vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
<?xml version="1.0" encoding="utf-8"?>
<package schemaVersion="1.3" xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd">
   <vendor>Maxim</vendor>
   <name>MAX32690</name>
   <url>https://www.mxim.net/microcontroller/pack/</url>
   <description>Maxim Integrated MAX32690 Series Device Support, Board Support Package and Examples</description>
   <supportContact>support@maximintegrated.com</supportContact>

   <license>License/END_USER_LICENSE_AGREEMENT.rtf</license>

   <releases>                  <!-- YYYY-MM-DD -->
      <release version="1.3.0" date="2023-06-14">
       - All Libraries updated to GCC v2023_03_Release, except for BLE.
      </release>
      <release version="1.2.2" date="2023-04-05">
       - Added the USB examples and Libraries only. (Other libraries and examples not updated)
      </release>   
      <release version="1.2.1" date="2022-11-18">
       - Added the HyperBus Example (HBMC) for IAR
      </release>    
      <release version="1.2.0" date="2022-10-24">
		- Updating the Example folder and Library folder to what is in GCC 
      	- MXC_NVIC_GetVector()did not get updated.  So updated that
      </release>     
      <release version="1.1.0" date="2022-10-12">
		- Updating the Example folder with Hash Example	  
      	- Pack Version content 1.0.1 is merged with this 1.1.0 version.  Changed local NVIC_SetVector() and NVIC_GetVector() names to MXC_NVIC_SetVector() and MXC_NVIC_GetVector().
      </release>  
      <release version="1.0.0" date="2022-06-13">
      	- IAR Pack File for MSDK.
      </release> 
   </releases>

   <keywords>
      <keyword>Maxim</keyword>
      <keyword>MAX32690</keyword>
      <keyword>MAX32690 Evaluation Kit</keyword>
      <keyword>Maxim Device Support</keyword>
      <keyword>Device Support</keyword>
      <keyword>Device Family Package Maxim</keyword>
      <keyword>Maxim Evaluation Kit</keyword>
   </keywords>

   <requirements>
      <languages>
         <language name="C" version="99" />
      </languages>
   </requirements>
   
   <devices>
      <family Dfamily="MAX32690 family" Dvendor="Maxim:23"> <!-- REMOVE THE EXTRA CHIP -->
         <book name="Doc/MAX32690_datasheet.txt" title="MAX32690 Family Data Sheet"/>
         <book name="Doc/MAX32690_userguide.txt" title="MAX32690 Family Users Guide"/>         
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.h" />
         <compile header="Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.h" define="MAX32690"/>
         <memory name="IROM1" access="rx" start="0x10000000" size="0x00080000" startup="1" default="1"/>
         <memory name="IRAM1" access="rwx" start="0x20000000" size="0x00020000" init="0" default="1"/>
<!--         <algorithm name="Flash/MAX32690.FLM" start="0x10000000" size="0x00080000" default="1"/> -->
<!--         <algorithm  name="FlashIAR/FlashMAX32690.flash" start="0x10000000" size="0x00080000" RAMstart="0x20000000" RAMsize="0x00020000" default="0" style="IAR"/> -->
         <description>
				The MAX32690 microcontroller (MCU) is an advanced system-on-chip (SoC) featuring an Arm® Cortex®-M4F CPU, large 
				Flash and SRAM memories, and the latest generation Bluetooth® 5 Low Energy (LE) radio. This device unites processing 
				horsepower with the connectivity required for IoT applications.
				The MCU offers many features to increase reliability: full-time error detection and correction (ECC) on processor cache and 
				optional ECC on SRAM. The MAX32690 is qualified to operate at a temperature range of -40°C to +105°C, ideal for Industrial 
				environments.
				Bluetooth® 5 Low Energy (LE) radio supports Mesh, LE Audio, angle of arrival (AoA), and angle of departure (AoD) for 
				direction finding, long-range (coded), and high-throughput modes. A dedicated RISC-V core handles timing-critical 
				controller tasks, freeing the programmer from BLE interrupt latency concerns.
				A Trust Protection Unit (TPU) provides advanced security features, including a Modular Arithmetic Accelerator (MAA) for 
				fast ECDSA, an AES Engine, TRNG, SHA-256 Hash, and a Secure Boot Loader.
				Internal code and data spaces can be expanded off-chip through a quad SPI execute-in-place (XIP) interface or a 
				Hyperbus/Xccela™ interface.
				Many high-speed interfaces are supported on the device, including multiple QSPI, UART, CAN 2.0, and I2
				C serial interfaces, 
				plus one I2
				S port for connecting to an audio codec. All interfaces support efficient DMA-driven transfers between peripheral 
				and memory. A 12-input (8 external), 12-Bit SAR ADC samples analog data at up to 1 MHz. 
         </description>     
     <!--    <feature type="IOs" n="48"/>
         <feature type="NVIC" n="110" name="NVIC"/>
         <feature type="DMA" n="16" name="DMA"/>
         <feature type="Timer" n="6" m="32" name="Timer Module"/>
         <feature type="WDT" n="3"/>
         <feature type="I2C" n="3" name="I2C"/>
         <feature type="SPI" n="3" m="50000000" name="QSPI"/>
         <feature type="UART" n="3" m="3000000" name="High-Speed UART Interface"/>
         <feature type="USBD" n="1" name="High-Speed USB Device"/> -->
         <!--<debug svd="SVD/MAX32690/MAX32690.svd" /> DELETE -->
		 <debug svd="Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.svd" version="1.3.0" />

         <debugport __dp="0">
            <swd idcode="0x2BA01477" />
         </debugport>

         <device Dname="MAX32690">
            <processor Dcore="Cortex-M4" DcoreVersion="r0p1" Pname="Cortex-M4" Punits="2" Dfpu="FPU" Dmpu="NO_MPU" Dendian="Little-endian" Dclock="96000000" />
         </device>

      </family>
   </devices>

   <!-- MAX32690 Evaluation Kit Board Support Package -->
   <boards>
      <board vendor="Maxim" name="MAX32690 EvKit" salesContact="sales@maximintegrated.com">
         <description>The MAX32690 Evaluation Kit provides a convenient platform for evaluating the capabilities of the MAX32690 Family of microcontrollers. The Evaluation Kit also provides a complete, functional system ideal for developing and debugging applications.
         </description>
         <book category="overview" name="Doc/MAX32690_EvKit.txt" title="MAX32690 EvKit Datasheet"/>
         <book category="schematic" name="Doc/MAX32690_EvKitSchematic.txt" title="MAX32690 EvKit Schematic"/>
    <!--     <feature type="PWR" n="5" name="USB Powered"/>
         <feature type="MemCard" n="1" name="SD Card Holder"/>
         <feature type="RAM" n="1" name="128kB SPIXR RAM"/>
         <feature type="ROM" n="1" name="8 MB SPIXF NOR-Flash"/>
         <feature type="USB" n="1" name="High-Speed USB Device, Micro-B receptacle"/>
         <feature type="Button" n="3" name="Push-buttons: Reset, 2x User"/>
         <feature type="LED" n="2" name="User LEDs"/>
         <feature type="GLCD" n="1" m="128.128" name="1.3 inch SPI LCD"/>
         <feature type="LineIn" n="1" name="TRS Audio Jack"/>
         <feature type="LineOut" n="1" name="TRS Audio Jack"/>
         <feature type="AIO" n="8" name="Analog Inputs"/>
         <feature type="DIO" n="16" name="Digital IOs"/> 
         <mountedDevice Dvendor="Maxim:23" Dname="MAX32656"/> -->
		 <mountedDevice Dvendor="Maxim:23" Dname="MAX32690"/>
         <debugInterface adapter="CMSIS-DAP" connector="10-pin Cortex Debug Connector (0.05 inch connector)"/>
         <debugInterface adapter="JTAG/SW" connector="20-pin Arm Standard JTAG Connector"/>
      </board>
   </boards>
  
   <!-- Evaluation Kit Example Programs -->
      
   <examples>  

	  <example name="ADC" doc="ARM/Abstract.txt" folder="Examples/MAX32690/ADC">
         <description>Analog to Digital Converter Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/ADC.ewp" />
<!--            <environment name="uv" load="ARM/ADC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="ADC"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
   
      <example name="CAN" doc="ARM/Abstract.txt" folder="Examples/MAX32690/CAN">
         <description>CAN Module Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CAN.ewp" />
<!--            <environment name="uv" load="ARM/CAN.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="CAN"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>   

      <example name="CRC" doc="ARM/Abstract.txt" folder="Examples/MAX32690/CRC">
         <description>CRC Module Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CRC.ewp" />
<!--            <environment name="uv" load="ARM/CRC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="CRC"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
