vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
	  <example name="CTB_AES" doc="ARM/Abstract.txt" folder="Examples/MAX32690/CTB_AES">
         <description>Analog to Digital Converter Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/CTB_AES.ewp" />
<!--            <environment name="uv" load="ARM/CTB_AES.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="CTB_AES"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  

      <example name="DMA" doc="ARM/Abstract.txt" folder="Examples/MAX32690/DMA">
         <description>Direct Memory Access Controller Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/DMA.ewp" />
<!--            <environment name="uv" load="ARM/DMA.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="DMA"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="Flash" doc="ARM/Abstract.txt" folder="Examples/MAX32690/Flash">
         <description>Flash Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Flash.ewp" />
 <!--           <environment name="uv" load="ARM/Flash.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="FLC"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

<!-- 	  <example name="FreeRTOSDemo" doc="ARM/Abstract.txt" folder="Examples/MAX32690/FreeRTOSDemo">
         <description>FreeRTOSDemo Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/FreeRTOSDemo.ewp" />
            <environment name="uv" load="ARM/FreeRTOSDemo.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
			<component Cbundle="Maxim API" Cclass="Device" Cgroup="FreeRTOSDemo"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> -->

 	  <example name="GPIO" doc="ARM/Abstract.txt" folder="Examples/MAX32690/GPIO">
         <description>GPIO Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/GPIO.ewp" />
 <!--           <environment name="uv" load="ARM/GPIO.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
			<component Cbundle="Maxim API" Cclass="Device" Cgroup="GPIO"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="Hash" doc="ARM/Abstract.txt" folder="Examples/MAX32690/Hash">
         <description>Hash Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hash.ewp" />
<!--            <environment name="uv" load="ARM/Hash.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="HBMC" doc="ARM/Abstract.txt" folder="Examples/MAX32690/HBMC">
         <description>HyperBus Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/HBMC.ewp" />
<!--            <environment name="uv" load="ARM/HBMC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
	  
	  
      <example name="Hello_World" doc="ARM/Abstract.txt" folder="Examples/MAX32690/Hello_World">
         <description>Hello World Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Hello_World.ewp" />
<!--            <environment name="uv" load="ARM/Hello_World.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  
	  

