vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
<!--      <example name="SPIXF" doc="ARM/Abstract.txt" folder="Examples/MAX32690/SPIXF">
         <description>SPIXF Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPIXF.ewp" />
             <environment name="uv" load="ARM/SPIXF.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>          
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>      
      </example>	  -->

<!--      <example name="SPIXR" doc="ARM/Abstract.txt" folder="Examples/MAX32690/SPIXR">
         <description>SPIXR Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/SPIXR.ewp" />
             <environment name="uv" load="ARM/SPIXR.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>          
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="SPI"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>      
      </example>   -->

      <example name="TRNG" doc="ARM/Abstract.txt" folder="Examples/MAX32690/TRNG">
         <description>Semaphore Module Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TRNG.ewp" />
<!--             <environment name="uv" load="ARM/TRNG.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TRNG"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

      <example name="USB_CDCACM" doc="ARM/Abstract.txt" folder="Examples/MAX32690/USB_CDCACM">
         <description>USB Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CDCACM.ewp" />
<!--             <environment name="uv" load="ARM/USB_CDCACM.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
      <example name="USB_CompositeDevice_MSC_CDC" doc="ARM/Abstract.txt" folder="Examples/MAX32690/USB_CompositeDevice_MSC_CDC">
         <description>USB Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CompositeDevice_MSC_CDC.ewp" />
<!--             <environment name="uv" load="ARM/USB_CompositeDevice_MSC_CDC.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 

      <example name="USB_CompositeDevice_MSC_HID" doc="ARM/Abstract.txt" folder="Examples/MAX32690/USB_CompositeDevice_MSC_HID">
         <description>USB Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_CompositeDevice_MSC_HID.ewp" />
<!--             <environment name="uv" load="ARM/USB_CompositeDevice_MSC_HID.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 
	  
      <example name="USB_HIDKeyboard" doc="ARM/Abstract.txt" folder="Examples/MAX32690/USB_HIDKeyboard">
         <description>USB Keyboard Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_HIDKeyboard.ewp" />
<!--             <environment name="uv" load="ARM/USB_HIDKeyboard.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>            
      <example name="USB_MassStorage" doc="ARM/Abstract.txt" folder="Examples/MAX32690/USB_MassStorage">
         <description>USB Mass Storage Device Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/USB_MassStorage.ewp" />
<!--             <environment name="uv" load="ARM/USB_MassStorage.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>  
            
