vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
      <example name="UART" doc="ARM/Abstract.txt" folder="Examples/MAX32690/UART">
         <description>UART Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/UART.ewp" />
<!--            <environment name="uv" load="ARM/UART.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="UART"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 


      <example name="Watchdog" doc="ARM/Abstract.txt" folder="Examples/MAX32690/Watchdog">
         <description>Watchdog Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/Watchdog.ewp" />
<!--             <environment name="uv" load="ARM/Watchdog.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WDT"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>


      <example name="BTLE Fit" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_fit">
         <description>BTLE Data Server Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_fit.ewp" />
<!--            <environment name="uv" load="ARM/BTLE_fit.uvprojx" />  -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>


      <example name="BTLE Dats" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_dats">
         <description>BTLE Data Server Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_dats.ewp" />
<!--            <environment name="uv" load="ARM/BTLE_dats.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>
	  	  
 	  
      <example name="BTLE Datc" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_datc">
         <description>BTLE Data Client Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_datc.ewp" />
<!--            <environment name="uv" load="ARM/BTLE_datc.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>	

<!--      <example name="BTLE FCC" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_fcc">
         <description>BTLE FCC Testing Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_fcc.ewp" />
            <environment name="uv" load="ARM/BTLE_datc.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>  -->

<!--      <example name="BTLE FreeRTOS" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_FreeRTOS">
         <description>BTLE FreeRTOS Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_FreeRTOS.ewp" />
            <environment name="uv" load="ARM/BTLE_datc.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>  -->

<!--      <example name="BTLE MCS" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_mcs">
         <description>BTLE Maxim Custom Service</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_mcs.ewp" />
            <environment name="uv" load="ARM/BTLE_datc.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>	 -->
	  
	  <example name="BTLE Periph" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_periph">
         <description>BTLE Peripheral Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_periph.ewp" />
<!--            <environment name="uv" load="ARM/BTLE_datc.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>	

