vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
	  <example name="BTLE4 CTR" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE4_ctr">
         <description>BTLE version 4.2 controller</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE4_ctr.ewp" />
<!--            <environment name="uv" load="ARM/BTLE_datc.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>

	  <example name="BTLE5 CTR" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE5_ctr">
         <description>BTLE version 5.2 controller</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE5_ctr.ewp" />
<!--            <environment name="uv" load="ARM/BTLE_datc.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>

<!--	  <example name="BTLE OTAS" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_otas">
         <description>BTLE Over the Air Slave, data transfer</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_otas.ewp" />
            <environment name="uv" load="ARM/BTLE_datc.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>  -->

<!-- 	  <example name="BTLE OTAC" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE_otac">
         <description>BTLE Over the Air Client, data transfer</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_otac.ewp" />
           <environment name="uv" load="ARM/BTLE_datc.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example> -->

      <example name="I2S" doc="ARM/Abstract.txt" folder="Examples/MAX32690/I2S">
         <description>I2S Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2S.ewp" />
<!--            <environment name="uv" load="ARM/I2S.uvprojx" />  -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2S"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	  
      <example name="LP" doc="ARM/Abstract.txt" folder="Examples/MAX32690/LP">
         <description>Low Power Capabilities Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/LP.ewp" />
<!--            <environment name="uv" load="ARM/LP.uvprojx" />  -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Low Power"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  

      <example name="TMR" doc="ARM/Abstract.txt" folder="Examples/MAX32690/TMR">
         <description>Timer Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TMR.ewp" />
<!--            <environment name="uv" load="ARM/TMR.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Timers"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	  

