vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
      <example name="WUT" doc="ARM/Abstract.txt" folder="Examples/MAX32690/WUT">
         <description>Wakeup Timer Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/WUT.ewp" />
<!--            <environment name="uv" load="ARM/WUT.uvprojx" /> -->
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="WUT"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>
	
<!--      <example name="WearLeveling" doc="ARM/Abstract.txt" folder="Examples/MAX32690/WearLeveling">
         <description>WearLeveling Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/WearLeveling.ewp" />
            <environment name="uv" load="ARM/WearLeveling.uvprojx" /> 
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
           <component Cbundle="Maxim API" Cclass="Device" Cgroup="WUT"/> 
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>	-->
	
<!--	

      <example name="AES" doc="ARM/Abstract.txt" folder="Examples/MAX32690/AES">
         <description>AES Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/AES.ewp" />
         <environment name="uv" load="ARM/AES.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>    


	  
      <example name="I2S" doc="ARM/Abstract.txt" folder="Examples/MAX32690/I2S">
         <description>I2S Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/I2S.ewp" />
            <environment name="uv" load="ARM/I2S.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="I2S"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example>

	  <example name="TFT" doc="ARM/Abstract.txt" folder="Examples/MAX32690/TFT_Demo">
         <description>TFT Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/TFT_Demo.ewp" />
            <environment name="uv" load="ARM/TFT_Demo.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="TFT"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Getting Started</keyword>
         </attributes>
      </example> 	 	    
	  
      <example name="BTLE BLE4 ctr" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE4-ctr">
         <description>BTLE BLE4 Controller</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BTLE_BLE4_ctr.ewp" />
            <environment name="uv" load="ARM/BTLE_BLE4_ctr.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>

      <example name="BTLE BLE5 ctr" doc="ARM/Abstract.txt" folder="Examples/MAX32690/BLE5-ctr">
         <description>BTLE BLE5 Controller</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BTLE_BLE5_ctr.ewp" />
            <environment name="uv" load="ARM/BTLE_BLE5_ctr.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>  
-->	  
<!--	  
      <example name="BTLE fit" doc="ARM/Abstract.txt" folder="Libraries/Cordio/ble-apps/build/fit">
         <description>BTLE fit Demo</description>
         <board name="MAX32690 EvKit" vendor="Maxim"/>
         <project>
            <environment name="iar" load="IAR/BLE_dats.ewp" />
            <environment name="uv" load="ARM/BTLE_fit.uvprojx" />
         </project>
         <attributes>
            <category>Example Project</category>
            <category>MAX32690 Evaluation Kit</category>
            <component Cclass="CMSIS" Cgroup="CORE"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="Startup"/>
            <component Cbundle="Maxim API" Cclass="Device" Cgroup="MAXUSB"/>
            <component Cbundle="Maxim API" Cclass="Bluetooth" Cgroup="Bluetooth LE"/>
            <component Cbundle="MAX32690 BSP" Cclass="BSP" Cgroup="Board Support"/>
            <keyword>Bluetooth Low Energy</keyword>
         </attributes>
      </example>
-->	  

	
<!-- BLE Added here -->
	  
