vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
   </examples>

   <conditions>
      <!-- MAX32690 Device Condition -->
      <condition id="MAX32690 Family">
         <description> Maxim Integrated MAX32690 device family</description>
         <require Dvendor="Maxim:23"/>
		 <require Dname="MAX32690"/>
      </condition>

      <!-- MAX32690 Device Condition -->
      <condition id="MAX32690 Device">
         <description> Maxim Integrated MAX32690 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32690"/>
      </condition>

      <!-- MAX32656 Device Condition -->
<!--      <condition id="MAX32656 Device">
         <description> Maxim Integrated MAX32690 device family</description>
         <require Dvendor="Maxim:23"/>
         <require Dname="MAX32656"/>
      </condition> -->

      <!-- MAX32690/51/52 CMSIS-CORE Condition -->
      <condition id="MAX32690 CMSIS-CORE">
         <description>Maxim MAX32690 Series devices and CMSIS-CORE</description>
         <require Cclass="CMSIS" Cgroup="CORE"/>
         <require condition="MAX32690 Family"/>
<!--         <accept condition="MAX32656 Device"/> -->
		 <accept condition="MAX32690 Device"/>
         <require Cclass="Device" Cgroup="Startup"/>
      </condition>

      <!-- GNUC/Eclipse Compiler Condition -->
      <condition id="Startup GCC">
         <description>Startup files for the GNU C Toolchain</description>
         <require Tcompiler="GCC"/>
      </condition>

      <!-- IAR Embedded Workbench Compiler Condition -->
      <condition id="Startup ARM">
         <description>Startup files for the KEIL Embedded Workbench Toolchain</description>
         <require Tcompiler="ARMCC"/>
      </condition> 
      <condition id="Startup IAR">
         <description>Startup files for the IAR Embedded Workbench Toolchain</description>
         <require Tcompiler="IAR"/>
      </condition>

      <!-- ADC Peripheral Condition -->
      <condition id="MAX32690 CMSIS ADC">
         <description>ADC Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>
	  
	  <!-- FreeRTOS condition -->
	  <condition id="MAX32690 CMSIS FreeRTOS">
         <description>FreeRTOS</description>
         <require condition="MAX32690 CMSIS-CORE" />
      </condition>	

	  <!-- littlefs condition -->
	  <condition id="MAX32690 CMSIS littlefs">
         <description>littlefs</description>
         <require condition="MAX32690 CMSIS-CORE" />
      </condition>		  
	  
      <!-- CTB Peripheral Condition -->
      <condition id="MAX32690 CMSIS CTB">
         <description>CTB Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	  
	  
      <!-- CAN Peripheral Condition -->
      <condition id="MAX32690 CMSIS CAN">
         <description>CAN Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	  

      <!-- LPCMP Peripheral Condition -->
      <condition id="MAX32690 CMSIS LPCMP">
         <description>LPCMP Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	
	  
      <!-- TFT Peripheral Condition -->
      <condition id="MAX32690 CMSIS TFT">
         <description>TFT Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	  

      <!-- AES Peripheral Condition -->
      <condition id="MAX32690 CMSIS AES">
         <description>AES Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>
	  
      <!-- CRC Peripheral Condition -->
      <condition id="MAX32690 CMSIS CRC">
         <description>CRC</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	
	
      <!-- Standard DMA Peripheral -->
      <condition id="MAX32690 CMSIS DMA">
         <description>Standard DMA</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- EMCC -->
      <condition id="MAX32690 CMSIS EMCC">
         <description>Ext. Mem. Cache Controller</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>		  

      <!-- FLash Controller Peripheral -->
      <condition id="MAX32690 CMSIS FLC">
         <description>Internal Flash Controller</description>
         <require condition="MAX32690 CMSIS-CORE"/>
         <require condition="MAX32690 CMSIS ICC"/>
      </condition>

      <!-- GPIO -->
      <condition id="MAX32690 CMSIS GPIO">
         <description>GPIO</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>
	  
      <!-- HPB -->
      <condition id="MAX32690 CMSIS HPB">
         <description>HPB</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	  

      <!-- I2C -->
      <condition id="MAX32690 CMSIS I2C">
         <description>I2C Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- I2S -->
      <condition id="MAX32690 CMSIS I2S">
         <description>I2S Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- ICC -->
      <condition id="MAX32690 CMSIS ICC">
         <description>Instruction Cache Controller</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- Low Power -->
      <condition id="MAX32690 CMSIS Low Power">
         <description>Low Power API</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- RTC -->
      <condition id="MAX32690 CMSIS RTC">
         <description>Real-Time Clock</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- SPI Peripheral -->
      <condition id="MAX32690 CMSIS SPI">
         <description>SPI Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- SPIXF Peripheral -->
      <condition id="MAX32690 CMSIS SPIXF">
         <description>SPIXF Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- SPIXR Peripheral -->
      <condition id="MAX32690 CMSIS SPIXR">
         <description>SPIXR Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

