vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
      <!-- SYS -->
      <condition id="MAX32690 CMSIS SYS">
         <description>SYS Interface</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- Timer -->
      <condition id="MAX32690 CMSIS TIMER">
         <description>Timers</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- TRNG -->
      <condition id="MAX32690 CMSIS TRNG">
         <description>Timers</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- UART -->
      <condition id="MAX32690 CMSIS UART">
         <description>UART</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>

      <!-- WDT -->
      <condition id="MAX32690 CMSIS WDT">
         <description>Watchdog Timers</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>
	  
	  <!-- USB -->
      <condition id="MAXUSB Core DEP">
         <description>MAXUSB HS Core</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition> 

      <condition id="MAXUSB DevClass DEP">
         <description>MAXUSB Device Class</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition> 	  
	  
      <!-- WUT -->
      <condition id="MAX32690 CMSIS WUT">
         <description>Wakeup Timer</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	 

      <!-- PT -->
      <condition id="MAX32690 CMSIS PT">
         <description>Pulse Train</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition>	  

      <!-- SIMO -->
<!--      <condition id="MAX32690 CMSIS SIMO">
         <description>Single Inductor Multiple Output DC/DC Converter</description>
         <require condition="MAX32690 CMSIS-CORE"/>
      </condition> -->

      <condition id="MAX32690 BSP DEP">	  
	     <description>Board Support Package</description>
         <!-- <require condition="MAX32690 CMSIS-CORE"/> -->
         <accept condition="MAX32690 Family"/>
         <require Cclass="Device" Cgroup="UART"/>
         <require Cclass="Device" Cgroup="GPIO"/>
      </condition>
	  
   </conditions>	  

   <components>
       <!--                                                                         
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A1" Cversion="1.3.0" versionMatchMode="fixed" condition="MAX32690 Family">
            <description>Target Rev A1 selected</description>
            <RTE_Components_h>
			 #define TARGET 32655   /* Target Device Part Number */
             #define TARGET_REV 0x4131       /* A1 chip */
            </RTE_Components_h>
       </component>
       <component Cgroup="Rev" Cclass="Target Rev" Cvariant="A2" Cversion="1.3.0" condition="MAX32690 Family">
             <description>Target Rev A2 selected</description>
             <RTE_Components_h>
			 #define TARGET 32655   /* Target Device Part Number */
             #define TARGET_REV 0x4132       /* A2 chip */
             </RTE_Components_h>
        </component> -->

<!-- BLE Added here -->

      <bundle Cbundle="Maxim BTLE" Cclass="Bluetooth" Cversion="1.3.0">
         <description>Maxim MAX32690 Bluetooth Low Energy Stack</description>
<!--      <doc>Libraries/BTLE/documentation/html/Cordio_Stack_Cordio_Profiles/index.html</doc> -->
        <doc>Libraries/Cordio/docs/index.html</doc>
         <component Cgroup="Bluetooth LE" condition="MAX32690 Family">
            <description>MAX32690 Bluetooth Libraries</description>
            <files>
     
               <!-- BLE include files -->
               <file category="include" name="Libraries/Cordio/ble-apps/sources/"/>				   
               <file category="include" name="Libraries/Cordio/ble-apps/sources/assettag/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/cycling/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/datc/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/dats/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/fit/"/>			   
               <file category="include" name="Libraries/Cordio/ble-apps/sources/hidapp/"/>			   
               <file category="include" name="Libraries/Cordio/ble-apps/sources/locator/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/medc/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/meds/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/tag/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/uribeacon/"/>
               <file category="include" name="Libraries/Cordio/ble-apps/sources/watch/"/>			   
			   
               <file category="include" name="Libraries/Cordio/ble-host/include/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/hci/common/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/hci/exactle/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/sec/common/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/stack/att/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/stack/cfg/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/stack/dm/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/stack/hci/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/stack/l2c/"/>
               <file category="include" name="Libraries/Cordio/ble-host/sources/stack/smp/"/> 
		
               <file category="include" name="Libraries/Cordio/ble-profiles/include/"/>		
               <file category="include" name="Libraries/Cordio/ble-profiles/sources/af/"/>
			   <file category="include" name="Libraries/Cordio/ble-profiles/sources/profiles/"/>
			   <file category="include" name="Libraries/Cordio/ble-profiles/sources/profiles/include/"/>
               <file category="include" name="Libraries/Cordio/ble-profiles/sources/profiles/gatt/"/>
               <file category="include" name="Libraries/Cordio/ble-profiles/sources/services/"/>


               <file category="include" name="Libraries/Cordio/controller/include/"/>
               <file category="include" name="Libraries/Cordio/controller/include/ble/"/>   			   
			   <file category="include" name="Libraries/Cordio/controller/include/common/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/ble/include/"/>			   
               <file category="include" name="Libraries/Cordio/controller/sources/ble/bb/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/ble/init/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/ble/lctr/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/ble/ll/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/ble/lmgr/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/ble/sch/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/common/bb/"/>
               <file category="include" name="Libraries/Cordio/controller/sources/common/sch/"/>

               <file category="include" name="Libraries/Cordio/platform/include/"/>			   
               <file category="include" name="Libraries/Cordio/platform/targets/maxim/max32690/sources/"/>

			   
