vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
               <file category="include" name="Libraries/Cordio/thirdparty/uecc/"/>

               <file category="include" name="Libraries/Cordio/wsf/include/"/>			   
               <file category="include" name="Libraries/Cordio/wsf/sources/targets/baremetal/"/>
               <file category="include" name="Libraries/Cordio/wsf/sources/util/"/>
			   
               <!-- BLE Source files -->
 <!--
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/assettag/assettag_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/cycling/cycling_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/datc/datc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/dats/dats_main.c"/>			   
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/fit/fit_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/gluc/gluc_main.c"/> -->
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/hidapp/hidapp_main.c"/>
 <!--              <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/locator/locator_main.c"/>  
			   <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_blp.c"/>	
			   <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_glp.c"/>	
			   <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_hrp.c"/>
			   <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_htp.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_main.c"/>			   
			   <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_plx.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/medc/medc_wsp.c"/>				   
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/meds/meds_blp.c"/>	
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/meds/meds_glp.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/meds/meds_htp.c"/>			   
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/meds/meds_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/meds/meds_plx.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/meds/meds_wsp.c"/>			   
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/sensor/sensor_main.c"/>	
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/tag/tag_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/uribeacon/uribeacon_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-apps/sources/watch/watch_main.c"/> -->

               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/common/hci_core.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/common/hci_tr.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd.c"/>			   
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_ae.c"/>
<!-- -->               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_bis.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_cis.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_cte.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_enc.c"/>
 <!--               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_iso.c"/> -->
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_cmd_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_core_ps.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_evt.c"/>			   
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_vs.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/hci/exactle/hci_vs_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_aes.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_aes_rev.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_ccm_hci.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_cmac_hci.c"/>
<!--               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_ecc_debug.c"/> -->
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_ecc_hci.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/sec/common/sec_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_disc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_eatt.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_proc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_read.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_sign.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/attc_write.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_ccc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_csf.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_dyn.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_eatt.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_ind.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_proc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_read.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_sign.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/atts_write.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/att_eatt.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/att_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/att/att_uuid.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/cfg/cfg_stack.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_adv.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_adv_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_adv_leg.c"/>
<!-- -->               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_bis_master.c"/> 
<!-- -->               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_cis_sm.c"/> 
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_cte.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_master_leg.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_slave_leg.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_conn_sm.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_dev.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_dev_priv.c"/>
 <!--                <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_iso.c"/>  -->
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_past.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_priv.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_scan.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_scan_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_scan_leg.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_sec.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_sec_lesc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_sec_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_sec_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/dm/dm_sync_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/hci/hci_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/l2c/l2c_coc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/l2c/l2c_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/l2c/l2c_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/l2c/l2c_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpi_act.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpi_sc_act.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpi_sc_sm.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpi_sm.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpr_act.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpr_sc_act.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpr_sc_sm.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smpr_sm.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smp_act.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smp_db.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smp_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smp_non.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smp_sc_act.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-host/sources/stack/smp/smp_sc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_disc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_master_leg.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_server.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_slave_leg.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/app_terminal.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/app_db.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/app_hw.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/app_ui.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/ui_console.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/ui_lcd.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/ui_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/ui_platform.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/af/common/ui_timer.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/anpc/anpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/atpc/atpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/atps/atps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/bas/bas_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/blpc/blpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/blps/blps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/cpp/cpps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/cscp/cscps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/dis/dis_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/fmpl/fmpl_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/gap/gap_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/gatt/gatt_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/glpc/glpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/glps/glps_db.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/glps/glps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/hid/hid_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/hrpc/hrpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/hrps/hrps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/htpc/htpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/htps/htps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/paspc/paspc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/plxpc/plxpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/plxps/plxps_db.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/plxps/plxps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/rscp/rscps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/scpps/scpps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/sensor/gyro_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/sensor/temp_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/tipc/tipc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/udsc/udsc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/uribeacon/uricfg_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxc/wdxc_ft.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxc/wdxc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxc/wdxc_stream.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxs/wdxs_au.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxs/wdxs_dc.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxs/wdxs_ft.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxs/wdxs_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxs/wdxs_phy.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wdxs/wdxs_stream.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wpc/wpc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wspc/wspc_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/profiles/wsps/wsps_main.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_alert.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_batt.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_bps.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_core.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_cps.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_cscs.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_cte.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_dis.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_gls.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_gyro.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_hid.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_hrs.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_hts.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_ipss.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_plxs.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_px.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_rscs.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_scpss.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_temp.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_time.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_uricfg.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_wdxs.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_wp.c"/>
               <file category="sourceC" name="Libraries/Cordio/ble-profiles/sources/services/svc_wss.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_adv_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_adv_master_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_adv_slave.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_adv_slave_ae.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_bis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_bis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_cis.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_cis_master.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_cis_slave.c"/> 
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_conn.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_conn_master.c"/>
               <file category="sourceC" name="Libraries/Cordio/controller/sources/ble/bb/bb_ble_conn_slave.c"/>
