vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
			   <file category="include" name="Libraries/PeriphDrivers/Source/ADC/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/AES/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CRC/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/DMA/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/EMCC/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/FLC/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/GPIO/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/HPB/" version="1.3.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2C/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/I2S/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/ICC/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LP/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/RTC/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPI/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPIXF/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/SPIXR/" version="1.3.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/SYS/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TMR/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/TRNG/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/UART/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WDT/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/WUT/" version="1.3.0"/>			   
			   <file category="include" name="Libraries/PeriphDrivers/Source/PT/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CTB/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/CAN/" version="1.3.0"/>
			   <file category="include" name="Libraries/PeriphDrivers/Source/LPCMP/" version="1.3.0"/>
			   
               <!-- Keil/ARM device startup file and sub_main to call SystemInit -->			   
               <file category="sourceAsm" attr="config" version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/ARM/startup_max32690.s" condition="Startup ARM" />
               <file category="sourceC" attr="config" version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/ARM/heap.c" condition="Startup ARM" />			   
<!--                <file category="sourceC" attr="config"  version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/IAR/low_level_init.c" condition="Startup IAR" /> -->
				
               <!-- GNUC/Eclipse device startup file -->
               <file category="sourceAsm" attr="config"  version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/GCC/startup_max32690.S" condition="Startup GCC" />

               <!-- IAR device startup file, low level init and cmain.s -->  
               <file category="sourceAsm" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/IAR/startup_max32690.s" condition="Startup IAR" version="1.3.0" />
               <file category="sourceC" attr="config"  version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/IAR/low_level_init.c" condition="Startup IAR" />
               <file category="sourceAsm" attr="config"  version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/IAR/cmain.s" condition="Startup IAR" />
               <file category="sourceC" attr="config"  version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/IAR/heap.c" condition="Startup IAR" />			   

               <!-- System, NVIC and device header files common to all platforms -->
               <file category="sourceC" attr="config"  version="1.3.0" name="Libraries/CMSIS/Device/Maxim/MAX32690/Source/system_max32690.c" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.3.0" />
               <file category="header" attr="config" name="Libraries/CMSIS/Device/Maxim/MAX32690/Include/max32690.h" version="1.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c"  version="1.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c"  version="1.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c"  version="1.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me18.c"  version="1.3.0" />
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me18.c"  version="1.3.0" />	   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c"  version="1.3.0" />		   
            </files>
         </component>

         <component Cgroup="ADC" condition="MAX32690 CMSIS ADC" Cversion="1.3.0"> 
         	 <description>ADC Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_me18.c" version="1.3.0"/>
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_common.c" version="1.3.0"/> -->
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/ADC/adc_revb.c" version="1.3.0"/>			   
            </files>
         </component>
		 
         <component Cgroup="CTB" condition="MAX32690 CMSIS CTB" Cversion="1.3.0"> 
         	 <description>CTB Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_common.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/CTB/ctb_reva.c" version="1.3.0"/>			   
            </files>
         </component>		 

         <component Cgroup="CAN" condition="MAX32690 CMSIS CAN" Cversion="1.3.0"> 
         	 <description>CAN Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CAN/can_me18.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/CAN/can_reva.c" version="1.3.0"/>			   
            </files>
         </component>

