vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
         <component Cgroup="LPCMP" condition="MAX32690 CMSIS LPCMP" Cversion="1.3.0"> 
         	 <description>LPCMP Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LPCMP/lpcmp_me18.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/LPCMP/lpcmp_reva.c" version="1.3.0"/>			   
            </files>
         </component>	
		 
         <component Cgroup="FreeRTOS" condition="MAX32690 CMSIS FreeRTOS" Cversion="1.3.0" >
             <description>FreeRTOS</description>
            <files>
               <file category="sourceC" name="Libraries/FreeRTOS/Source/list.c" version="1.3.0" />	
               <file category="sourceC" name="Libraries/FreeRTOS/Source/queue.c" version="1.3.0" />
               <file category="sourceC" name="Libraries/FreeRTOS/Source/tasks.c" version="1.3.0" />				
               <file category="sourceC" name="Libraries/FreeRTOS/Source/portable/IAR/ARM_CM4F/port.c" version="1.3.0" condition="Startup IAR" />
               <file category="sourceC" name="Libraries/FreeRTOS/Source/portable/MemMang/heap_2.c" version="1.3.0" />
               <file category="sourceAsm" name="Libraries/FreeRTOS/Source/portable/Tasking/ARM_CM4F/port_asm.asm" version="1.3.0" condition="Startup IAR"/>			   
               <file category="sourceC" name="Libraries/FreeRTOS/Source/timers.c" version="1.3.0" />
               <file category="sourceC" name="Libraries/FreeRTOS/Source/croutine.c" version="1.3.0" />
               <file category="sourceC" name="Libraries/FreeRTOS/Source/event_groups.c" version="1.3.0" />
               <file category="sourceC" name="Libraries/FreeRTOS/Source/stream_buffer.c" version="1.3.0" />			   
		       <file category="include" name="Libraries/FreeRTOS/Source/portable/IAR/ARM_CM4F/" version="1.3.0" condition="Startup IAR"/>
		       <file category="include" name="Libraries/FreeRTOS/Source/include/" version="1.3.0" />
               <file category="sourceC" name="Libraries/FreeRTOS-Plus/Source/FreeRTOS-Plus-CLI/FreeRTOS_CLI.c" version="1.3.0" />
	           <file category="include" name="Libraries/FreeRTOS-Plus/Source/FreeRTOS-Plus-CLI/" version="1.3.0" />			
         </files>
      </component>	

         <component Cgroup="littlefs" condition="MAX32690 CMSIS littlefs" Cversion="1.3.0"> 
         	 <description>littlefs Interface</description>
            <files>
               <file category="sourceC" name="Libraries/littlefs/lfs.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/littlefs/lfs_util.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/littlefs/bd/lfs_filebd.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/littlefs/bd/lfs_rambd.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/littlefs/bd/lfs_testbd.c" version="1.3.0"/>
	           <file category="include" name="Libraries/littlefs/" version="1.3.0" />
	           <file category="include" name="Libraries/littlefs/bd/" version="1.3.0" />				   
            </files>
         </component>


	
         <component Cgroup="TFT" condition="MAX32690 CMSIS TFT" Cversion="1.3.0"> 
         	 <description>TFT Interface</description>
            <files>
        <!-- 	   <file category="sourceC" name="Libraries/Boards/MAX32690/Source/tft.c" version="1.3.0"/> -->
        <!--       <file category="sourceC" name="Libraries/Boards/MAX32690/Source/touchscreen.c" version="1.3.0"/>	   -->
            </files>
         </component>		 

         <component Cgroup="AES" condition="MAX32690 CMSIS AES" Cversion="1.3.0"> 
         	 <description>AES Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_me18.c" version="1.3.0"/>
	           <file category="sourceC" name="Libraries/PeriphDrivers/Source/AES/aes_revb.c" version="1.3.0"/>			   
            </files>
         </component>
		 
		 <component Cgroup="CRC" condition="MAX32690 CMSIS CRC" Cversion="1.3.0"> 
         	 <description>Camera Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_me17.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/CRC/crc_reva.c" version="1.3.0"/>
            </files>
         </component>		 

         <component Cgroup="DMA" condition="MAX32690 CMSIS DMA" Cversion="1.3.0">
            <description>Standard DMA</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/DMA/dma_reva.c" version="1.3.0"/>
            </files>
         </component>
		 
		 <component Cgroup="EMCC" condition="MAX32690 CMSIS EMCC" Cversion="1.3.0">
            <description> Hyperbus </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/EMCC/emcc_me18.c" version="1.3.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/EMCC/emcc_reva.c" version="1.3.0"/>			   
            </files>
         </component>			 

         <component Cgroup="FLC" condition="MAX32690 CMSIS FLC" Cversion="1.3.0" >
            <description> Flash Controller </description>
            <files>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_me18.c" version="1.3.0"/>			
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_common.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_reva.c" version="1.3.0"/>		
		<!--	   <file category="sourceC" name="Libraries/PeriphDrivers/Source/FLC/flc_revb.c" version="1.3.0"/> -->
            </files>
         </component>
		 
		 <component Cgroup="GPIO" condition="MAX32690 CMSIS GPIO" Cversion="1.3.0">
            <description> GPIO </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_reva.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/GPIO/gpio_common.c" version="1.3.0"/>		   
            </files>
         </component>
		 
