vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
		 <component Cgroup="HPB" condition="MAX32690 CMSIS HPB" Cversion="1.3.0">
            <description> Hyperbus </description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/HPB/hpb_me18.c" version="1.3.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/HPB/hpb_reva.c" version="1.3.0"/>			   
            </files>
         </component>		 
		 
		 
        <component Cgroup="I2C" condition="MAX32690 CMSIS I2C" Cversion="1.3.0">
            <description>I2C Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2C/i2c_reva.c" version="1.3.0"/>			   
            </files>
         </component>		 
		 
        <component Cgroup="I2S" condition="MAX32690 CMSIS I2S" Cversion="1.3.0">
            <description>I2S Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/I2S/i2s_reva.c" version="1.3.0"/>			   
            </files>
         </component>		 		 

         <component Cgroup="ICC" condition="MAX32690 CMSIS ICC" Cversion="1.3.0">
            <description>Instruction Cache Controller</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_reva.c" version="1.3.0"/>
			   <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/ICC/icc_common.c" version="1.3.0"/> -->
            </files>
         </component>		 
		 
         <component Cgroup="Low Power" condition="MAX32690 CMSIS Low Power" Cversion="1.3.0">
            <description>Low Power API</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/LP/lp_me18.c" version="1.3.0"/>			   
            </files>
         </component>		 
		 
         <component Cgroup="RTC" condition="MAX32690 CMSIS RTC" Cversion="1.3.0">
            <description>Real-Time Clock</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/RTC/rtc_reva.c" version="1.3.0"/>			   
            </files>
         </component>

         <component Cgroup="SPI" condition="MAX32690 CMSIS SPI" Cversion="1.3.0">
            <description>SPI Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_me18.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPI/spi_reva.c" version="1.3.0"/>			   
            </files>
         </component>
		 
         <component Cgroup="SPIXF" condition="MAX32690 CMSIS SPIXF" Cversion="1.3.0">
            <description>SPIXF Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXF/spixf_me18.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXF/spixf_reva.c" version="1.3.0"/>			   
            </files>
         </component>		 

         <component Cgroup="SPIXR" condition="MAX32690 CMSIS SPIXR" Cversion="1.3.0">
            <description>SPIXR Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXR/spixr_me18.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SPIXR/spixr_reva.c" version="1.3.0"/>			   
            </files>
         </component>	

         <component Cgroup="SYS" condition="MAX32690 CMSIS SYS" Cversion="1.3.0">
            <description>SYS Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/sys_me18.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_me18.c" version="1.3.0"/>
               <!-- <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/pins_es17.c" version="1.3.0"/> -->				   
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/nvic_table.c" version="1.3.0"/>	
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_lock.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_delay.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/SYS/mxc_assert.c" version="1.3.0"/>

            </files>
         </component>

         <component Cgroup="Timers" condition="MAX32690 CMSIS TIMER" Cversion="1.3.0">
            <description>32-Bit Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_revb.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TMR/tmr_common.c" version="1.3.0"/>			   
            </files>
         </component>

         <component Cgroup="TRNG" condition="MAX32690 CMSIS TRNG" Cversion="1.3.0">
            <description>TRNG</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/TRNG/trng_revb.c" version="1.3.0"/>		   
            </files>
         </component>


         <component Cgroup="UART" condition="MAX32690 CMSIS UART" Cversion="1.3.0">
            <description>UART Interface</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_revb.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/UART/uart_common.c" version="1.3.0"/>
            </files>
         </component>

