vvpai9/Keil/Keil_v5/ARM/Pack/.Web/Maxim.MAX32690.pdsc
         <component Cgroup="WDT" condition="MAX32690 CMSIS WDT" Cversion="1.3.0">
            <description>Watchdog Timers</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_revb.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WDT/wdt_common.c" version="1.3.0"/>
            </files>
         </component>		 

         <component Cgroup="WUT" condition="MAX32690 CMSIS WUT" Cversion="1.3.0">
            <description>Wakeup Timer</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/WUT/wut_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/WUT/wut_reva.c" version="1.3.0"/>
            </files>
         </component>

         <component Cgroup="PT" condition="MAX32690 CMSIS PT" Cversion="1.3.0">
            <description>Wakeup Timer</description>
            <files>
               <file category="sourceC" name="Libraries/PeriphDrivers/Source/PT/pt_me18.c" version="1.3.0"/>
			   <file category="sourceC" name="Libraries/PeriphDrivers/Source/PT/pt_reva.c" version="1.3.0"/>
            </files>
         </component>
		 
      </bundle>
	  
	  <bundle Cbundle="MAXUSB" Cclass="USB" Cversion="1.3.0">
         <description>Maxim Developed USB Device Stack</description>
         <doc>Libraries/MAXUSB/readme.txt</doc>
         <component Cgroup="Core" condition="MAXUSB Core DEP">
            <description>MAXUSB Core Files</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/core/musbhsfc/" version="1.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/core/" version="1.3.0"/>
               <file category="include" name="Libraries/MAXUSB/include/enumerate/" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/musbhsfc/usb.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/core/usb_event.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/enumerate/enumerate.c" version="1.3.0"/>
            </files>
         </component>
         <component Cgroup="Device Class" condition="MAXUSB DevClass DEP">
            <description>MAXUSB Device Class Files</description>
            <files>
               <file category="include" name="Libraries/MAXUSB/include/devclass/" version="1.3.0"/>
          <!--     <file category="include" name="Libraries/MAXUSB/include/util/" version="1.3.0"/> -->
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/cdc_acm.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/fifo.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_kbd.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/hid_raw.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MAXUSB/src/devclass/msc.c" version="1.3.0"/>
            </files>
         </component>
      </bundle>
	  
      <bundle Cbundle="MAX32690 BSP" Cclass="BSP" Cversion="1.3.0">
         <description>MAX32690 Evaluation Kit Board Support Package</description>
         <doc>Doc/MAX32690_EvKit.txt</doc>
            <component Cgroup="EvKit V1" condition="MAX32690 BSP DEP">
		    <!-- <component Cgroup="EvKit V1"> -->
            <description>MAX32690 Evaluation Kit Board Setup</description>
            <RTE_Components_h>
               #define BOARD EvKit_V1 /* Target Board */
            </RTE_Components_h>
            <files>
			   <file category="include" name="Libraries/Boards/MAX32690/EvKit_V1/Include/" version="1.3.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32690/EvKit_V1/Source/board.c" version="1.3.0"/>	   			   
               <file category="include" name="Libraries/Boards/MAX32690/Include/" version="1.3.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32690/Source/led.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32690/Source/pb.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32690/Source/stdio.c" version="1.3.0"/>
               <file category="sourceC" name="Libraries/Boards/MAX32690/EvKit_V1/Source/board.c" version="1.3.0"/>	
               <file category="sourceC" name="Libraries/MiscDrivers/ExtMemory/mx25.c" version="1.3.0"/>
               <file category="include" name="Libraries/MiscDrivers/ExtMemory/" version="1.3.0"/>
               <file category="sourceC" name="Libraries/MiscDrivers/Display/tft_st7735.c" version="1.3.0"/>
               <file category="include" name="Libraries/MiscDrivers/Display/" version="1.3.0"/>			   
<!--               <file category="sourceC" name="Libraries/Boards/MAX32690/Source/tft.c" version="1.3.0"/> -->
<!--               <file category="sourceC" name="Libraries/Boards/MAX32690/Source/touchscreen.c" version="1.3.0"/> -->
           </files>
         </component>
      </bundle> 
   </components>
</package>